Documents/ЛБ_МаршрутПоездки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_МаршрутПоездки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПунктаНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельПоездки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_Ломбарды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Ломбарды</Name>
			<Comment>Ломбарды</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйФилиал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДневнойЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛомбарда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрефиксВНомереЗБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_МаршрутПоездки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	
	СтатусДокумента = 1;
	
	ПериодНачало = НачалоМесяца(ТекущаяДата());
	ПериодОкончание = КонецМесяца(ТекущаяДата());
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Должность = ДолжностьРуководителя(ПараметрыСеанса.ТекущийСотрудник);
		Отделение = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДата(), ПараметрыСеанса.ТекущийЛомбард);
		Элементы.ОтделениеОтбор.ТолькоПросмотр = Истина;
		Если Должность = Неопределено Тогда
			Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
			Элементы.Сотрудник.ТолькоПросмотр = Истина;
		Иначе 
			Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;  
		Элементы.ОрганизацияВШапке.ТолькоПросмотр = Истина;
	Иначе  
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда   
			Элементы.Сотрудник.ТолькоПросмотр = Истина;    
			Элементы.СписокСоздать.Доступность = Ложь;
			Элементы.СписокСкопировать.Доступность = Ложь;
			Элементы.СписокУстановитьПометкуУдаления.Доступность = Ложь;
			Элементы.СписокПровести.Доступность = Ложь;
			Элементы.СписокОтменаПроведения.Доступность = Ложь; 
			Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
				Элементы.СписокПечать.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Элементы.СписокПечать.Доступность = Ложь;
	КонецЕсли;
	
	УстановитьПериодОтбора();
	
	ВыбратьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)  
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные.ПометкаУдаления = Истина Тогда
		Предупреждение("Помеченный на удаление документ не может быть проведен!");  
		Возврат;
	Иначе 
		Если	 
			ТекДанные.Адрес = "" Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Адрес"));  
			Возврат;
		ИначеЕсли 
			ТекДанные.ЦельПоездки = "" Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Цель поездки"));
			Возврат;
		ИначеЕсли 
			ТекДанные.ВидТранспорта = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыТранспорта.ПустаяСсылка") Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Вид транспорта")); 
			Возврат;
		ИначеЕсли 
			ТекДанные.ПунктНазначения = "" Тогда
			ТекСтрока = Элементы.Список.ТекущаяСтрока; 
			Провести = ПровестиНаСервере(ТекСтрока);
			Если Провести = Неопределено Тогда 
				ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
				|Проведение документа невозможно.", "Пункт назначения/Ломбард пункта назначения"));    
			КонецЕсли;
		Иначе  
			ТекСтрока = Элементы.Список.ТекущаяСтрока;
			ПровестиНаСервере(ТекСтрока, Истина);  
		КонецЕсли;    
	КонецЕсли;
	
	Элементы.Список.Обновить(); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаления(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.ПометкаУдаления Тогда
			ТекстВопроса = СтрШаблон("Снять с ""Маршрут поездки сотрудника %1 от %2"" пометку на удаление?", ТекСтрока.Руководитель, ТекСтрока.Дата);   
		Иначе
			ТекстВопроса = СтрШаблон("Пометить ""Маршрут поездки сотрудника %1 от %2"" на удаление?", ТекСтрока.Руководитель, ТекСтрока.Дата);   
		КонецЕсли;
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда			
			Документ = Элементы.Список.ТекущаяСтрока;
			ПометитьНаУдалениеНаСервере(Документ);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Список.Обновить();		
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда) 
	
	Если НЕ СотрудникЦО() Тогда
		Если Должность = Неопределено Тогда
			ДокументыПоСотруднику = ДокументыПоСотруднику(ПериодНачало, КонецДня(ПериодОкончание), Сотрудник);
			
			МассивРуководителей = Новый Массив;
			Для Каждого Документ Из ДокументыПоСотруднику Цикл
				МассивРуководителей.Добавить(Документ.Руководитель);
			КонецЦикла;
			
			Результат = Руководители(МассивРуководителей);
			
			МассивДокументов = Новый Массив;
			
			Если Результат.Количество() > 1 Тогда
				СписокРуководителей = Новый СписокЗначений;				
				Для Каждого Строка Из Результат Цикл
					СписокРуководителей.Добавить(Строка);	
				КонецЦикла;
				
				ВыбЭлемент = СписокРуководителей.ВыбратьЭлемент("Для печати отчета выберите руководителя"); 
				Если ВыбЭлемент = Неопределено Тогда
					Возврат; 
				Иначе
					ВыбРуководитель = ВыбЭлемент.Значение;
				КонецЕсли;
				
				Для Каждого Документ Из ДокументыПоСотруднику Цикл
					Если Документ.Руководитель = ВыбРуководитель Тогда
						МассивДокументов.Добавить(Документ.Документ);
					КонецЕсли;
				КонецЦикла; 
			Иначе
				Для Каждого Документ Из ДокументыПоСотруднику Цикл
					МассивДокументов.Добавить(Документ.Документ);
				КонецЦикла;			
			КонецЕсли;  
		Иначе
			МассивДокументов = МассивОбъектов(ПериодНачало, КонецДня(ПериодОкончание), Сотрудник);
		КонецЕсли;
	Иначе
		МассивДокументов = МассивОбъектов(ПериодНачало, КонецДня(ПериодОкончание), Сотрудник);
	КонецЕсли; 
	
	Если МассивДокументов.Количество() > 0 Тогда   
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("ИменаМакетов", "ОтчетПоездок"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_МаршрутПоездки");
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивДокументов);
		
		Если ПериодНачало = НачалоМесяца(ПериодНачало) И КонецДня(ПериодОкончание) = КонецМесяца(ПериодОкончание)
			И Месяц(ПериодНачало) = Месяц(ПериодОкончание) Тогда
			Период = Формат(ПериодНачало, "ДФ='MMMM гггг ""г.""'");
			ПараметрыФормы.Вставить("ПараметрыПечати", Новый Структура("Период", Период));
		Иначе   
			ПараметрыФормы.Вставить("ПараметрыПечати", Новый Структура("НачалоПериода, ОкончаниеПериода", 
			Формат(ПериодНачало, "ДФ=dd.MM.yyyy"), Формат(ПериодОкончание, "ДФ=dd.MM.yyyy")));
		КонецЕсли;
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтотОбъект,,,,,);  
	Иначе
		Предупреждение("Нет документов для вывода на печать!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоПриИзменении(Элемент) 
	ДействияПриИзмененииДаты();  
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеПриИзменении(Элемент) 
	ДействияПриИзмененииДаты(); 
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент) 
	ВыбратьДанные(); 
	ПроизвестиОтборПоСтатусу();
КонецПроцедуры 

&НаКлиенте
Процедура ОтделениеОтборПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Отделение) Тогда
		Элементы.Сотрудник.ТолькоПросмотр = Ложь;
	Иначе
		Сотрудник = ПредопределенноеЗначение("Справочник.ЛБ_Сотрудники.ПустаяСсылка");
		Элементы.Сотрудник.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	ВыбратьДанные(); 
	ПроизвестиОтборПоСтатусу(); 
КонецПроцедуры 

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Элементы.СписокПечать.Доступность = Истина;
	Иначе
		Элементы.СписокПечать.Доступность = Ложь;
	КонецЕсли; 
	
	ВыбратьДанные();
	ПроизвестиОтборПоСтатусу();
КонецПроцедуры

&НаСервере
Процедура ВыбратьДанные() 
	Список.ТекстЗапроса = "ВЫБРАТЬ
	|ДокументЛБ_МаршрутПоездки.Ссылка КАК Ссылка,
	|ДокументЛБ_МаршрутПоездки.ПометкаУдаления КАК ПометкаУдаления,
	|ДокументЛБ_МаршрутПоездки.Номер КАК Номер,
	|ДокументЛБ_МаршрутПоездки.Дата КАК Дата,
	|ДокументЛБ_МаршрутПоездки.Проведен КАК Проведен,
	|ДокументЛБ_МаршрутПоездки.Организация КАК Организация,
	|ДокументЛБ_МаршрутПоездки.Отделение КАК Отделение,
	|ДокументЛБ_МаршрутПоездки.ЛомбардПользователя КАК ЛомбардПользователя,
	|ДокументЛБ_МаршрутПоездки.Руководитель КАК Руководитель,
	|ДокументЛБ_МаршрутПоездки.Должность КАК Должность,
	|ДокументЛБ_МаршрутПоездки.ВремяПрибытия КАК ВремяПрибытия,
	|ДокументЛБ_МаршрутПоездки.ВремяУбытия КАК ВремяУбытия,
	|ДокументЛБ_МаршрутПоездки.ПунктНазначения КАК ПунктНазначения,
	|ДокументЛБ_МаршрутПоездки.ЛомбардПунктаНазначения КАК ЛомбардПунктаНазначения,
	|ДокументЛБ_МаршрутПоездки.Адрес КАК Адрес,
	|ДокументЛБ_МаршрутПоездки.ЦельПоездки КАК ЦельПоездки,
	|ДокументЛБ_МаршрутПоездки.Ответственный КАК Ответственный,
	|ДокументЛБ_МаршрутПоездки.Комментарий КАК Комментарий,
	|ДокументЛБ_МаршрутПоездки.ВидТранспорта КАК ВидТранспорта,
	|ДокументЛБ_МаршрутПоездки.МоментВремени КАК МоментВремени
	|ИЗ
	| Документ.ЛБ_МаршрутПоездки КАК ДокументЛБ_МаршрутПоездки
	|ГДЕ
	| ДокументЛБ_МаршрутПоездки.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Если Должность = Неопределено Тогда
			Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Ответственный = &Ответственный";
			Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ПараметрыСеанса.ТекущийСотрудник);   
		Иначе 
			Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Отделение = &Отделение";   
			Список.Параметры.УстановитьЗначениеПараметра("Отделение", Отделение);
			ОтборПоОтделению(Отделение);
			Если ЗначениеЗаполнено(Сотрудник) Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Руководитель = &Руководитель";
				Список.Параметры.УстановитьЗначениеПараметра("Руководитель", Сотрудник);
			КонецЕсли; 
		КонецЕсли;
	Иначе 
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда  
			Если ЗначениеЗаполнено(Отделение) Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Отделение = &Отделение";
				Список.Параметры.УстановитьЗначениеПараметра("Отделение", Отделение);
				ОтборПоОтделению(Отделение);
				Если ЗначениеЗаполнено(Сотрудник) Тогда
					Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Руководитель = &Руководитель";
					Список.Параметры.УстановитьЗначениеПараметра("Руководитель", Сотрудник);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДолжностьРуководителя(Сотрудник)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	|	ВТ_Сотрудник КАК ВТ_Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|		ПО ВТ_Сотрудник.Сотрудник = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
	|	И (ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
	|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
	|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ОтборПоОтделению(ОтделениеОтбора) 
	ЛомбардыОтделения = ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ПериодОкончание, Отделение);
	
	Элементы.Сотрудник.РежимВыбораИзСписка = Истина;
	Элементы.Сотрудник.СписокВыбора.ЗагрузитьЗначения(СписокРуководителей(ЛомбардыОтделения)); 
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодОтбора() 
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", ПериодНачало);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(ПериодОкончание)); 
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзмененииДаты();
	ОчиститьСообщения();
	
	Если ПериодНачало > ПериодОкончание Тогда
		Предупреждение("Дата начала периода не может быть больше даты окончания периода!");
	Иначе
		УстановитьПериодОтбора(); 
		ВыбратьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ПроизвестиОтборПоСтатусу(); 
	Если 
		СтатусДокумента = 2 Тогда
		Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Проведен = Ложь";  
	ИначеЕсли 
		СтатусДокумента = 3 Тогда
		Список.ТекстЗапроса = Список.ТекстЗапроса + " И ДокументЛБ_МаршрутПоездки.Проведен = Истина";   
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста 
Функция СотрудникЦО()  
	Возврат УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО");	
КонецФункции 

&НаСервереБезКонтекста 
Функция Руководители(МассивРуководителей)	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРуководителей);
КонецФункции

&НаСервереБезКонтекста 
Функция СписокРуководителей(ЛомбардыОтделения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(, Подразделение В (&Ломбарды)) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|		ПО ВТ_Сотрудники.Сотрудник = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
	|	И (ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
	|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
	|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)";
	
	Запрос.УстановитьПараметр("Ломбарды", ЛомбардыОтделения);  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Руководители = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Руководители.Добавить(Выборка.Сотрудник);
	КонецЦикла;    
	
	Возврат Руководители;
КонецФункции

&НаСервереБезКонтекста
Функция ПровестиНаСервере(Документ, Провести = Неопределено)
	ДокОбъект = Документ.ПолучитьОбъект();
	
	Если Провести <> Неопределено Тогда
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
		КонецПопытки;
	Иначе  
		СтруктураВозврата = Новый Структура;    
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		| ЛБ_МаршрутПоездки.ЛомбардПунктаНазначения КАК ЛомбардПунктаНазначения
		|ИЗ
		| Документ.ЛБ_МаршрутПоездки КАК ЛБ_МаршрутПоездки
		|ГДЕ
		| ЛБ_МаршрутПоездки.Ссылка = &Ссылка
		| И ЛБ_МаршрутПоездки.ЛомбардПунктаНазначения <> ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			Исключение
			КонецПопытки;
			СтруктураВозврата.Вставить("Результат", Истина);
			Возврат СтруктураВозврата; 
		КонецЕсли;
	КонецЕсли;  
КонецФункции

&НаСервереБезКонтекста
Функция ДокументыПоСотруднику(ДатаНачала, ДатаОкончания, Сотрудник)
	
	МассивОбъектов = Новый Массив;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_МаршрутПоездки.Ссылка КАК Ссылка,
	|	ЛБ_МаршрутПоездки.Руководитель КАК Руководитель
	|ИЗ
	|	Документ.ЛБ_МаршрутПоездки КАК ЛБ_МаршрутПоездки
	|ГДЕ
	|	ЛБ_МаршрутПоездки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЛБ_МаршрутПоездки.Проведен = ИСТИНА
	|	И ЛБ_МаршрутПоездки.Ответственный = &Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_МаршрутПоездки.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("Документ, Руководитель", Выборка.Ссылка, Выборка.Руководитель);
		МассивОбъектов.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат МассивОбъектов;
КонецФункции

&НаСервере
Функция МассивОбъектов(ПериодНачало, ПериодОкончание, Руководитель)
	
	МассивОбъектов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| ЛБ_МаршрутПоездки.Ссылка КАК Ссылка
	|ИЗ
	| Документ.ЛБ_МаршрутПоездки КАК ЛБ_МаршрутПоездки
	|ГДЕ
	| ЛБ_МаршрутПоездки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	| И ЛБ_МаршрутПоездки.Проведен = ИСТИНА
	| И ЛБ_МаршрутПоездки.Руководитель = &Руководитель
	|
	|УПОРЯДОЧИТЬ ПО
	| ЛБ_МаршрутПоездки.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодОкончание);		
	Запрос.УстановитьПараметр("Руководитель", Руководитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивОбъектов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивОбъектов;
КонецФункции

&НаСервереБезКонтекста
Функция ПометитьНаУдалениеНаСервере(Документ)	
	ДокОбъект = Документ.ПолучитьОбъект(); 
	
	Если ДокОбъект.ПометкаУдаления Тогда
		ДокОбъект.УстановитьПометкуУдаления(Ложь);
	Иначе
		ДокОбъект.УстановитьПометкуУдаления(Истина);			
	КонецЕсли; 
	
КонецФункции
